In [ ]:
a = "sample"

In [ ]:
a.index('p')

In [ ]:
k = input("Please enter your character") 
a[a.index(k):]+a[:a.index(k)]

In [ ]:
s="abcdefghijklmnop"
w=2
result=
print(result)

In [ ]:
pip install textwrap3

In [ ]:
import textwrap

In [ ]:
import textwrap
s="abcdefghijklmnop"
w=2
result=textwrap.wrap(s,w)
print(result)

In [ ]:
import math
print(math.pi)

In [ ]:
a=int(input())
b=int(input())
try:
    x=a/b
except (ZeroDivisionError,ValueError):
    print("e")
    
else:
    print(x)
print("end of program")

In [ ]:
class voter(Exception):
    def display(self):
        print('hi')
try:
    x=int(input())
    if(x<18):
        raise voter
except voter:
    print('age is less than 18')
    
else:
    print('age is greater 18')
y=voter()
y.display()

In [ ]:
def add(x,y):
    print(x+y)

In [ ]:
add(5,3)

In [ ]:
add(5,10)

In [ ]:
n=17
for x in range(1,n+1):
    print(x,oct(x).replace("0o",""),hex(x).replace("0x","").upper(),bin(x).replace("0b",""))

In [ ]:
n=17
oct(n).replace("0o","")

In [ ]:
from IPython.display import Image

In [ ]:
Image(url="",height=350,width=100)

In [ ]:
Image(url="")

In [ ]:
def print_formatted(number):

    width = len("{0:b}".format(number))

    for i in range(1, number + 1):
        print("{0:{w}d} {0:{w}o} {0:{w}X} {0:{w}b}".format(i, w = width))

if __name__ == '__main__':
    n = int(input())
    print_formatted(n)

In [ ]:
number=17
width = len("{0:b}".format(number))
print(width)

In [ ]:
import re

In [ ]:
txt="hii mr manojkk king kingdom kirf kiue"
f=re.findall("m+",txt)
print(f)
if f:
    print("it is correct")
else:
    print("it is not ok")

In [ ]:
def solve(s):
    d=s.title()
    print(d)
s="1 w 2 r 3g"
result=solve(s)

In [ ]:
from itertools import product
A=map(int,input().split())
B=map(int,input().split())
C=[list(A),list(B)]
print(list(product(*C)),e)

10
2 3 4 5 6 8 7 6 5 18
6
6 55
6 45
6 55
4 40
18 60
10 50

In [ ]:
n=10
size=[2,3,4,5,6,8,7,6,5,18]
customers=6
c1=[6,55]
c2=[6,45]

In [ ]:
from collections import Counter
myList = [2,3,4,5,6,8,7,6,5,18]
print(Counter(myList))
print(Counter(myList).items())
print(Counter(myList).keys())
print(Counter(myList).values())

In [ ]:
a=0
b=1
n=20
print(a)
print(b)
for x in range(1,n):
    c=a+b
    a=b
    b=c
    print(c)

In [ ]:
x=10
shoie_size=[2,3,4,5,6,8,7,6,5,18]
n=6
l=[[6, 55], [6, 45], [6, 55], [4, 40], [18, 60], [10, 50]]
"""for x in range(n):
    s=map(int,input().split())
    l.append(list(s))"""
print(l)

In [ ]:
count=0
for x in shoie_size:
    for y in l:
        if x==y[0]:
            shoie_size.remove(x)
            count=count+1
print(shoie_size)
print(count)

In [ ]:
from itertools import permutations
s,p=map(str,input().split())
p=int(p)
b=list(permutations(s,p))
b.sort()
for x in b:
    c="".join(map(str,x))
    print(c)

In [ ]:
from itertools import combinations
s,p=map(str,input().split())
p=int(p)
b=list(combinations(s,p))
print(b)

In [ ]:
a=4j
b=6
c=a+b
print(c)

In [ ]:
import cmath
s=complex(input())
print(cmath.polar(s))

In [ ]:
from math import sin
(math.radians(90))

In [ ]:
import math

In [ ]:
math.asin(math.

In [ ]:
print(math.degrees(math.asin(0.707)))

In [ ]:
math.sqrt(5)

In [ ]:
import math
ab=int(input())
bc=int(input())
mc=math.sqrt((ab**2)+(bc**2))/2
theta=math.degrees(math.asin(mc/bc))
print(str(round(theta))+'°')

In [ ]:
# Enter your code here. Read input from STDIN. Print output to STDOUT
n,m=map(int,input().split())
ln=list(map(int,input().split()))
a=set(map(int,input().split()))
b=set(map(int,input().split()))
c=set(ln)
d=c.intersection(a)
e=c.intersection(b)
f=len(d)
g=len(e)
print(f-g)

In [ ]:
pip install calendra

In [ ]:
import calendar

In [ ]:
print(calendar.TextCalendar(firstweekday=6).formatyear(1999))

## get day (input : A single line of input containing the space separated date , month and year, respectively, in  DD MM YYYY format

In [ ]:
import calendar
k = list(map(int,input().split()))
m = calendar.weekday(k[2],k[1],k[0])
w = ['MONDAY','TUESDAY','WEDNESDAY','THURSDAY','FRIDAY','SATURDAY','SUNDAY']
print(w[m])

In [ ]:
a=int(input())
for x in range(a):
    b=list(map(int,input().split()))
    try:
        b[0]/b[1]
    except ValueError as f:
        print("Error Code:",f)

N = int(raw_input())
a = []
for i in range(N):
    a.append(raw_input().split())
for j in range(len(a)):
    try:
        print int(a[j][0])//int(a[j][1])
    except ZeroDivisionError as e:
        print "Error Code:", e
    except ValueError as f:
        print "Error Code:", f

In [ ]:
N = int(input())
a = []
for i in range(N):
    a.append(input().split())
for j in range(len(a)):
    try:
        print(int(a[j][0])//int(a[j][1]))
    except ZeroDivisionError as e:
        print("Error Code:", e)
    except ValueError as f:
        print("Error Code:", f)

In [ ]:
try:
    print(1/int("#"))
except ValueError as e:
    print("value roor:",e)

In [ ]:
a=[1,2,3,4,5]
a.remove(1)
b=a
print(b)

In [ ]:
pip install faker

In [ ]:
from faker import Faker
fake=Faker()

In [ ]:
print(fake.email())
print(fake.country())
print(fake.name())
#print(fake.text())
print(fake.url())

In [ ]:
pip install pywhatkit

In [7]:
import pywhatkit
pywhatkit.sendwhatmsg("+917995855926","hii i am automating message bot what could i help you",9,31)

In 37 seconds web.whatsapp.com will open and after 20 seconds message will be delivered

In [1]:
import pandas as pd

In [5]:
import numpy as np

In [66]:
d={"a":[1,2,np.nan],"b":[13,np.nan,np.nan],"c":[5,6,7],"d":[6,7,9]}

In [67]:
df=pd.DataFrame(d)

In [68]:
df

     a     b  c  d
0  1.0  13.0  5  6
1  2.0   NaN  6  7
2  NaN   NaN  7  9

In [69]:
df.dropna(thresh=2)

     a     b  c  d
0  1.0  13.0  5  6
1  2.0   NaN  6  7
2  NaN   NaN  7  9

In [70]:
df["a"].fillna(value=df["a"].mean())

0    1.0
1    2.0
2    1.5
Name: a, dtype: float64

In [72]:
df

     a     b  c  d
0  1.0  13.0  5  6
1  2.0   NaN  6  7
2  NaN   NaN  7  9

In [73]:
len(df)

3

2

In [74]:
df.count()

a    2
b    1
c    3
d    3
dtype: int64

In [61]:
meana=df["a"].mean()
meanb=df["b"].mean()
meanc=df["c"].mean()

In [62]:
df["a"].fillna(value=meana,inplace=True)
df["b"].fillna(value=meanb,inplace=True)
df["c"].fillna(value=meanc,inplace=True)

In [63]:
df

     a     b  c  d
0  1.0  13.0  5  6
1  2.0  13.0  6  7
2  1.5  13.0  7  9

In [81]:
a={"company":["google","google","facebook","facebook","amazon","amazon"],"person":["manoj","akhil","arjun","naresh","teja","dinesh"],"sales":[500,100,140,240,222,123]}

In [104]:
df=pd.DataFrame(a)

In [105]:
df

   a  b  key
0  1  6   11
1  2  7   22
2  3  8   33
3  4  9   44
4  5  0   55

In [87]:
get=df.groupby("company")

In [89]:
get.sum()

          sales
company
amazon      345
facebook    380
google      600

In [90]:
get.mean()

          sales
company
amazon    172.5
facebook  190.0
google    300.0

In [91]:
get.max()

          person  sales
company
amazon      teja    222
facebook  naresh    240
google     manoj    500

In [93]:
get.min()

          person  sales
company
amazon    dinesh    123
facebook   arjun    140
google     akhil    100

In [98]:
get.max().transpose()

company amazon facebook google
person    teja   naresh  manoj
sales      222      240    500

In [109]:
a={
    "a":[1,2,3,4,5],
    "b":[6,7,8,9,0],
    "key":[11,22,33,44,55]
}

In [110]:
b={
    "c":[16,16,45,12,22],
    "d":[6,2,6,8,9],
    "key":[11,22,33,44,55]
}

In [111]:
c={
    "e":[99,0,33,44,55],
    "f":[6,7,8,9,0],
    "key":[11,22,33,44,55]
}

In [112]:
df1=pd.DataFrame(a)
df2=pd.DataFrame(b)
df3=pd.DataFrame(c)

In [116]:
pd.concat([df1,df2,df3],axis=1)

   a  b  key   c  d  key   e  f  key
0  1  6   11  16  6   11  99  6   11
1  2  7   22  16  2   22   0  7   22
2  3  8   33  45  6   33  33  8   33
3  4  9   44  12  8   44  44  9   44
4  5  0   55  22  9   55  55  0   55

In [119]:
pd.merge(df1,df2,on="key")

   a  b  key   c  d
0  1  6   11  16  6
1  2  7   22  16  2
2  3  8   33  45  6
3  4  9   44  12  8
4  5  0   55  22  9

In [120]:
df

    e  f  key
0  99  6   11
1   0  7   22
2  33  8   33
3  44  9   44
4  55  0   55

In [123]:
df.columns

Index(['e', 'f', 'key'], dtype='object')